In [1]:
import pandas as pd

In [2]:
emt = pd.DataFrame()
print(emt)

Empty DataFrame
Columns: []
Index: []

In [4]:
lst = ['a','b','c','d','e']
df = pd.DataFrame(lst)
print(df)

   0
0  a
1  b
2  c
3  d
4  e

In [5]:
df

   0
0  a
1  b
2  c
3  d
4  e

In [7]:
ls_of_ls = [['a','b','c'],['d','e','f'],['g','h','i']]
df1 = pd.DataFrame(ls_of_ls)
df1

   0  1  2
0  a  b  c
1  d  e  f
2  g  h  i

In [8]:
# Using Dictionary 
dict = {'ID': [1,2,3,4]}
df2 = pd.DataFrame(dict)
df2      # or print(df2)

   ID
0   1
1   2
2   3
3   4

In [9]:
dict = {'ID': [1,2,3,4], 'Name': ['Arman','Noman','Ruman','Stern'], 'Salary': [45000,30000,60000,65000]}
df2 = pd.DataFrame(dict)
df2

   ID   Name  Salary
0   1  Arman   45000
1   2  Noman   30000
2   3  Ruman   60000
3   4  Stern   65000

In [10]:
# Using list and dictionary.

lst_dict = [{'ID':1, 'Name':'Arman', 'Salary':45000},{'ID':2, 'Name':'Noman', 'Salary':30000},{'ID':3, 'Name':'Stern',}]
df3 = pd.DataFrame(lst_dict)
df3

   ID   Name   Salary
0   1  Arman  45000.0
1   2  Noman  30000.0
2   3  Stern      NaN

In [11]:
# Using Dict & Series

dt_sr = {'ID':pd.Series([1,2,3]), 'Name':pd.Series(['Arman','Noman','Stern']), 'Salary':pd.Series([45000])}
df4 = pd.DataFrame(dt_sr)
df4

   ID   Name   Salary
0   1  Arman  45000.0
1   2  Noman      NaN
2   3  Stern      NaN